zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CAN_HUB.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CAN_HUB.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CAN_HUB
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CAN_HUB_H_)  /* Check if memory map has not been already included */
#define S32K566_CAN_HUB_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CAN_HUB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_HUB_Peripheral_Access_Layer CAN_HUB Peripheral Access Layer
 * @{
 */

/** CAN_HUB - Register Layout Typedef */
typedef struct CAN_HUB_Struct {
  __I  uint32_t CANNETW;                           /**< CAN Module Connected to Bus Flag, offset: 0x0 */
  uint8_t RESERVED_0[124];
  __I  uint32_t CAN0ALWGRP;                        /**< CAN0 Allowable Groups, offset: 0x80 */
  __I  uint32_t CAN1ALWGRP;                        /**< CAN1 Allowable Groups, offset: 0x84 */
  __I  uint32_t CAN2ALWGRP;                        /**< CAN2 Allowable Groups, offset: 0x88 */
  __I  uint32_t CAN3ALWGRP;                        /**< CAN3 Allowable Groups, offset: 0x8C */
  __I  uint32_t CAN4ALWGRP;                        /**< CAN4 Allowable Groups, offset: 0x90 */
  __I  uint32_t CAN5ALWGRP;                        /**< CAN5 Allowable Groups, offset: 0x94 */
  __I  uint32_t CAN6ALWGRP;                        /**< CAN6 Allowable Groups, offset: 0x98 */
  __I  uint32_t CAN7ALWGRP;                        /**< CAN7 Allowable Groups, offset: 0x9C */
  __I  uint32_t CAN8ALWGRP;                        /**< CAN8 Allowable Groups, offset: 0xA0 */
  __I  uint32_t CAN9ALWGRP;                        /**< CAN9 Allowable Groups, offset: 0xA4 */
  __I  uint32_t CAN10ALWGRP;                       /**< CAN10 Allowable Groups, offset: 0xA8 */
  __I  uint32_t CAN11ALWGRP;                       /**< CAN11 Allowable Groups, offset: 0xAC */
  __I  uint32_t CAN12ALWGRP;                       /**< CAN12 Allowable Groups, offset: 0xB0 */
  __I  uint32_t CAN13ALWGRP;                       /**< CAN13 Allowable Groups, offset: 0xB4 */
  __I  uint32_t CAN14ALWGRP;                       /**< CAN14 Allowable Groups, offset: 0xB8 */
  __I  uint32_t CAN15ALWGRP;                       /**< CAN15 Allowable Groups, offset: 0xBC */
  __I  uint32_t CAN16ALWGRP;                       /**< CAN16 Allowable Groups, offset: 0xC0 */
  uint8_t RESERVED_1[60];
  __IO uint32_t CAN0GRPCTL;                        /**< CAN0 Module Group Control Register, offset: 0x100 */
  __IO uint32_t CAN1GRPCTL;                        /**< CAN1 Module Group Control Register, offset: 0x104 */
  __IO uint32_t CAN2GRPCTL;                        /**< CAN2 Module Group Control Register, offset: 0x108 */
  __IO uint32_t CAN3GRPCTL;                        /**< CAN3 Module Group Control Register, offset: 0x10C */
  __IO uint32_t CAN4GRPCTL;                        /**< CAN4 Module Group Control Register, offset: 0x110 */
  __IO uint32_t CAN5GRPCTL;                        /**< CAN5 Module Group Control Register, offset: 0x114 */
  __IO uint32_t CAN6GRPCTL;                        /**< CAN6 Module Group Control Register, offset: 0x118 */
  __IO uint32_t CAN7GRPCTL;                        /**< CAN7 Module Group Control Register, offset: 0x11C */
  __IO uint32_t CAN8GRPCTL;                        /**< CAN8 Module Group Control Register, offset: 0x120 */
  __IO uint32_t CAN9GRPCTL;                        /**< CAN9 Module Group Control Register, offset: 0x124 */
  __IO uint32_t CAN10GRPCTL;                       /**< CAN10 Module Group Control Register, offset: 0x128 */
  __IO uint32_t CAN11GRPCTL;                       /**< CAN11 Module Group Control Register, offset: 0x12C */
  __IO uint32_t CAN12GRPCTL;                       /**< CAN12 Module Group Control Register, offset: 0x130 */
  __IO uint32_t CAN13GRPCTL;                       /**< CAN13 Module Group Control Register, offset: 0x134 */
  __IO uint32_t CAN14GRPCTL;                       /**< CAN14 Module Group Control Register, offset: 0x138 */
  __IO uint32_t CAN15GRPCTL;                       /**< CAN15 Module Group Control Register, offset: 0x13C */
  __IO uint32_t CAN16GRPCTL;                       /**< CAN16 Module Group Control Register, offset: 0x140 */
} CAN_HUB_Type, *CAN_HUB_MemMapPtr;

/** Number of instances of the CAN_HUB module. */
#define CAN_HUB_INSTANCE_COUNT                   (1u)

/* CAN_HUB - Peripheral instance base addresses */
/** Peripheral CAN_HUB base address */
#define IP_CAN_HUB_BASE                          (0x4028C000u)
/** Peripheral CAN_HUB base pointer */
#define IP_CAN_HUB                               ((CAN_HUB_Type *)IP_CAN_HUB_BASE)
/** Array initializer of CAN_HUB peripheral base addresses */
#define IP_CAN_HUB_BASE_ADDRS                    { IP_CAN_HUB_BASE }
/** Array initializer of CAN_HUB peripheral base pointers */
#define IP_CAN_HUB_BASE_PTRS                     { IP_CAN_HUB }

/* ----------------------------------------------------------------------------
   -- CAN_HUB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_HUB_Register_Masks CAN_HUB Register Masks
 * @{
 */

/*! @name CANNETW - CAN Module Connected to Bus Flag */
/*! @{ */

#define CAN_HUB_CANNETW_STATUS_MASK              (0x1FFFFU)
#define CAN_HUB_CANNETW_STATUS_SHIFT             (0U)
#define CAN_HUB_CANNETW_STATUS_WIDTH             (17U)
#define CAN_HUB_CANNETW_STATUS(x)                (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CANNETW_STATUS_SHIFT)) & CAN_HUB_CANNETW_STATUS_MASK)
/*! @} */

