zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CAN_HUB.h
/*! @name CAN0ALWGRP - CAN0 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN0ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN0ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN0ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN0ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN0ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN0ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN1ALWGRP - CAN1 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN1ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN1ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN1ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN1ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN1ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN1ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN2ALWGRP - CAN2 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN2ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN2ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN2ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN2ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN2ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN2ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN3ALWGRP - CAN3 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN3ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN3ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN3ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN3ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN3ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN3ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN4ALWGRP - CAN4 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN4ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN4ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN4ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN4ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN4ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN4ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN5ALWGRP - CAN5 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN5ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN5ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN5ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN5ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN5ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN5ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN6ALWGRP - CAN6 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN6ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN6ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN6ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN6ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN6ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN6ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN7ALWGRP - CAN7 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN7ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN7ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN7ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN7ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN7ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN7ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN8ALWGRP - CAN8 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN8ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN8ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN8ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN8ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN8ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN8ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN9ALWGRP - CAN9 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN9ALWGRP_ALWGRP_MASK           (0x7FFFFFFU)
#define CAN_HUB_CAN9ALWGRP_ALWGRP_SHIFT          (0U)
#define CAN_HUB_CAN9ALWGRP_ALWGRP_WIDTH          (27U)
#define CAN_HUB_CAN9ALWGRP_ALWGRP(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN9ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN9ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN10ALWGRP - CAN10 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN10ALWGRP_ALWGRP_MASK          (0x7FFFFFFU)
#define CAN_HUB_CAN10ALWGRP_ALWGRP_SHIFT         (0U)
#define CAN_HUB_CAN10ALWGRP_ALWGRP_WIDTH         (27U)
#define CAN_HUB_CAN10ALWGRP_ALWGRP(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN10ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN10ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN11ALWGRP - CAN11 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN11ALWGRP_ALWGRP_MASK          (0x7FFFFFFU)
#define CAN_HUB_CAN11ALWGRP_ALWGRP_SHIFT         (0U)
#define CAN_HUB_CAN11ALWGRP_ALWGRP_WIDTH         (27U)
#define CAN_HUB_CAN11ALWGRP_ALWGRP(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN11ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN11ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN12ALWGRP - CAN12 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN12ALWGRP_ALWGRP_MASK          (0x7FFFFFFU)
#define CAN_HUB_CAN12ALWGRP_ALWGRP_SHIFT         (0U)
#define CAN_HUB_CAN12ALWGRP_ALWGRP_WIDTH         (27U)
#define CAN_HUB_CAN12ALWGRP_ALWGRP(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN12ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN12ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN13ALWGRP - CAN13 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN13ALWGRP_ALWGRP_MASK          (0x7FFFFFFU)
#define CAN_HUB_CAN13ALWGRP_ALWGRP_SHIFT         (0U)
#define CAN_HUB_CAN13ALWGRP_ALWGRP_WIDTH         (27U)
#define CAN_HUB_CAN13ALWGRP_ALWGRP(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN13ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN13ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN14ALWGRP - CAN14 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN14ALWGRP_ALWGRP_MASK          (0x7FFFFFFU)
#define CAN_HUB_CAN14ALWGRP_ALWGRP_SHIFT         (0U)
#define CAN_HUB_CAN14ALWGRP_ALWGRP_WIDTH         (27U)
#define CAN_HUB_CAN14ALWGRP_ALWGRP(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN14ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN14ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN15ALWGRP - CAN15 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN15ALWGRP_ALWGRP_MASK          (0x7FFFFFFU)
#define CAN_HUB_CAN15ALWGRP_ALWGRP_SHIFT         (0U)
#define CAN_HUB_CAN15ALWGRP_ALWGRP_WIDTH         (27U)
#define CAN_HUB_CAN15ALWGRP_ALWGRP(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN15ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN15ALWGRP_ALWGRP_MASK)
/*! @} */

/*! @name CAN16ALWGRP - CAN16 Allowable Groups */
/*! @{ */

#define CAN_HUB_CAN16ALWGRP_ALWGRP_MASK          (0x7FFFFFFU)
#define CAN_HUB_CAN16ALWGRP_ALWGRP_SHIFT         (0U)
#define CAN_HUB_CAN16ALWGRP_ALWGRP_WIDTH         (27U)
#define CAN_HUB_CAN16ALWGRP_ALWGRP(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN16ALWGRP_ALWGRP_SHIFT)) & CAN_HUB_CAN16ALWGRP_ALWGRP_MASK)
/*! @} */

