zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CAN_HUB.h
/*! @name CAN0GRPCTL - CAN0 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN0GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN0GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN0GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN0GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN0GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN0GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN0GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN0GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN0GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN0GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN0GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN0GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN1GRPCTL - CAN1 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN1GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN1GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN1GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN1GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN1GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN1GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN1GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN1GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN1GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN1GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN1GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN1GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN2GRPCTL - CAN2 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN2GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN2GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN2GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN2GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN2GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN2GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN2GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN2GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN2GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN2GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN2GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN2GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN3GRPCTL - CAN3 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN3GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN3GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN3GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN3GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN3GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN3GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN3GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN3GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN3GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN3GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN3GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN3GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN4GRPCTL - CAN4 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN4GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN4GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN4GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN4GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN4GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN4GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN4GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN4GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN4GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN4GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN4GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN4GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN5GRPCTL - CAN5 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN5GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN5GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN5GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN5GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN5GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN5GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN5GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN5GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN5GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN5GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN5GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN5GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN6GRPCTL - CAN6 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN6GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN6GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN6GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN6GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN6GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN6GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN6GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN6GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN6GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN6GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN6GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN6GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN7GRPCTL - CAN7 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN7GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN7GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN7GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN7GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN7GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN7GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN7GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN7GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN7GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN7GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN7GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN7GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN8GRPCTL - CAN8 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN8GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN8GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN8GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN8GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN8GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN8GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN8GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN8GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN8GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN8GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN8GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN8GRPCTL_HWFLTR_MASK)
/*! @} */

