zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CAN_HUB.h
/*! @name CAN9GRPCTL - CAN9 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN9GRPCTL_USECANBUS_MASK        (0x1FU)
#define CAN_HUB_CAN9GRPCTL_USECANBUS_SHIFT       (0U)
#define CAN_HUB_CAN9GRPCTL_USECANBUS_WIDTH       (5U)
#define CAN_HUB_CAN9GRPCTL_USECANBUS(x)          (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN9GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN9GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN9GRPCTL_HWFLTR_MASK           (0x3F0000U)
#define CAN_HUB_CAN9GRPCTL_HWFLTR_SHIFT          (16U)
#define CAN_HUB_CAN9GRPCTL_HWFLTR_WIDTH          (6U)
#define CAN_HUB_CAN9GRPCTL_HWFLTR(x)             (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN9GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN9GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN10GRPCTL - CAN10 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN10GRPCTL_USECANBUS_MASK       (0x1FU)
#define CAN_HUB_CAN10GRPCTL_USECANBUS_SHIFT      (0U)
#define CAN_HUB_CAN10GRPCTL_USECANBUS_WIDTH      (5U)
#define CAN_HUB_CAN10GRPCTL_USECANBUS(x)         (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN10GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN10GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN10GRPCTL_HWFLTR_MASK          (0x3F0000U)
#define CAN_HUB_CAN10GRPCTL_HWFLTR_SHIFT         (16U)
#define CAN_HUB_CAN10GRPCTL_HWFLTR_WIDTH         (6U)
#define CAN_HUB_CAN10GRPCTL_HWFLTR(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN10GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN10GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN11GRPCTL - CAN11 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN11GRPCTL_USECANBUS_MASK       (0x1FU)
#define CAN_HUB_CAN11GRPCTL_USECANBUS_SHIFT      (0U)
#define CAN_HUB_CAN11GRPCTL_USECANBUS_WIDTH      (5U)
#define CAN_HUB_CAN11GRPCTL_USECANBUS(x)         (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN11GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN11GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN11GRPCTL_HWFLTR_MASK          (0x3F0000U)
#define CAN_HUB_CAN11GRPCTL_HWFLTR_SHIFT         (16U)
#define CAN_HUB_CAN11GRPCTL_HWFLTR_WIDTH         (6U)
#define CAN_HUB_CAN11GRPCTL_HWFLTR(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN11GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN11GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN12GRPCTL - CAN12 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN12GRPCTL_USECANBUS_MASK       (0x1FU)
#define CAN_HUB_CAN12GRPCTL_USECANBUS_SHIFT      (0U)
#define CAN_HUB_CAN12GRPCTL_USECANBUS_WIDTH      (5U)
#define CAN_HUB_CAN12GRPCTL_USECANBUS(x)         (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN12GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN12GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN12GRPCTL_HWFLTR_MASK          (0x3F0000U)
#define CAN_HUB_CAN12GRPCTL_HWFLTR_SHIFT         (16U)
#define CAN_HUB_CAN12GRPCTL_HWFLTR_WIDTH         (6U)
#define CAN_HUB_CAN12GRPCTL_HWFLTR(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN12GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN12GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN13GRPCTL - CAN13 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN13GRPCTL_USECANBUS_MASK       (0x1FU)
#define CAN_HUB_CAN13GRPCTL_USECANBUS_SHIFT      (0U)
#define CAN_HUB_CAN13GRPCTL_USECANBUS_WIDTH      (5U)
#define CAN_HUB_CAN13GRPCTL_USECANBUS(x)         (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN13GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN13GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN13GRPCTL_HWFLTR_MASK          (0x3F0000U)
#define CAN_HUB_CAN13GRPCTL_HWFLTR_SHIFT         (16U)
#define CAN_HUB_CAN13GRPCTL_HWFLTR_WIDTH         (6U)
#define CAN_HUB_CAN13GRPCTL_HWFLTR(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN13GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN13GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN14GRPCTL - CAN14 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN14GRPCTL_USECANBUS_MASK       (0x1FU)
#define CAN_HUB_CAN14GRPCTL_USECANBUS_SHIFT      (0U)
#define CAN_HUB_CAN14GRPCTL_USECANBUS_WIDTH      (5U)
#define CAN_HUB_CAN14GRPCTL_USECANBUS(x)         (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN14GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN14GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN14GRPCTL_HWFLTR_MASK          (0x3F0000U)
#define CAN_HUB_CAN14GRPCTL_HWFLTR_SHIFT         (16U)
#define CAN_HUB_CAN14GRPCTL_HWFLTR_WIDTH         (6U)
#define CAN_HUB_CAN14GRPCTL_HWFLTR(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN14GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN14GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN15GRPCTL - CAN15 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN15GRPCTL_USECANBUS_MASK       (0x1FU)
#define CAN_HUB_CAN15GRPCTL_USECANBUS_SHIFT      (0U)
#define CAN_HUB_CAN15GRPCTL_USECANBUS_WIDTH      (5U)
#define CAN_HUB_CAN15GRPCTL_USECANBUS(x)         (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN15GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN15GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN15GRPCTL_HWFLTR_MASK          (0x3F0000U)
#define CAN_HUB_CAN15GRPCTL_HWFLTR_SHIFT         (16U)
#define CAN_HUB_CAN15GRPCTL_HWFLTR_WIDTH         (6U)
#define CAN_HUB_CAN15GRPCTL_HWFLTR(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN15GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN15GRPCTL_HWFLTR_MASK)
/*! @} */

/*! @name CAN16GRPCTL - CAN16 Module Group Control Register */
/*! @{ */

#define CAN_HUB_CAN16GRPCTL_USECANBUS_MASK       (0x1FU)
#define CAN_HUB_CAN16GRPCTL_USECANBUS_SHIFT      (0U)
#define CAN_HUB_CAN16GRPCTL_USECANBUS_WIDTH      (5U)
#define CAN_HUB_CAN16GRPCTL_USECANBUS(x)         (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN16GRPCTL_USECANBUS_SHIFT)) & CAN_HUB_CAN16GRPCTL_USECANBUS_MASK)

#define CAN_HUB_CAN16GRPCTL_HWFLTR_MASK          (0x3F0000U)
#define CAN_HUB_CAN16GRPCTL_HWFLTR_SHIFT         (16U)
#define CAN_HUB_CAN16GRPCTL_HWFLTR_WIDTH         (6U)
#define CAN_HUB_CAN16GRPCTL_HWFLTR(x)            (((uint32_t)(((uint32_t)(x)) << CAN_HUB_CAN16GRPCTL_HWFLTR_SHIFT)) & CAN_HUB_CAN16GRPCTL_HWFLTR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CAN_HUB_Register_Masks */

/*!
 * @}
 */ /* end of group CAN_HUB_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CAN_HUB_H_) */
